MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/ll/stm32c5xx_ll_opamp.h
/**
  ******************************************************************************
  * @file    stm32c5xx_ll_opamp.h
  * @brief   Header file of OPAMP LL module.
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2026 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef STM32C5XX_LL_OPAMP_H
#define STM32C5XX_LL_OPAMP_H

#ifdef __cplusplus
extern "C" {
#endif

/* Includes ------------------------------------------------------------------*/
#include "stm32c5xx.h"

/** @addtogroup STM32C5xx_LL_Driver
  * @{
  */
#if defined (OPAMP1) || defined (OPAMP2) || defined(OPAMP3)

/** @defgroup OPAMP_LL OPAMP
  * @{
  */

/* Private types -------------------------------------------------------------*/
/* Private variables ---------------------------------------------------------*/
/* Private constants ---------------------------------------------------------*/
/** @defgroup OPAMP_LL_Private_Constants OPAMP Private Constants
  * @{
  */

/* Internal mask for OPAMP power mode:                                        */
/* To select into literal LL_OPAMP_POWERMODE_x the relevant bits for:         */
/* - OPAMP power mode into control register                                   */
/* - OPAMP trimming register offset                                           */


/* Mask for OPAMP power mode into control register */
#define OPAMP_SPEED_MODE_CSR_BIT_MASK            (OPAMP_CSR_OPAHSM)

/* CSR register reset value */
#define OPAMP_CSR_RESET_VALUE  ((uint32_t)0x00000000) /*!< CSR reset value.*/

#define OPAMP_CSR_RESET_BITS                     (OPAMP_CSR_OPAEN          \
                                                  | OPAMP_CSR_CALOUT       \
                                                  | OPAMP_CSR_TRIMOFFSETN  \
                                                  | OPAMP_CSR_TRIMOFFSETP  \
                                                  | OPAMP_CSR_PGA_GAIN     \
                                                  | OPAMP_CSR_CALSEL       \
                                                  | OPAMP_CSR_CALON        \
                                                  | OPAMP_CSR_OPAINTOEN    \
                                                  | OPAMP_CSR_OPAHSM       \
                                                  | OPAMP_CSR_VM_SEL       \
                                                  | OPAMP_CSR_VP_SEL       \
                                                 )  /*!< CSR reset all bits, except USERTRIM and LOCK */

/* TCMR register reset value */
#define OPAMP_TCMR_RESET_VALUE  ((uint32_t)0x00000000) /*!< TCMR reset value.*/

#define OPAMP_TCMR_RESET_BITS                    (OPAMP_TCMR_VMS_SEL      \
                                                  | OPAMP_TCMR_VPS_SEL    \
                                                  | OPAMP_TCMR_TIMCM_SEL  \
                                                  | OPAMP_TCMR_PGAS_GAIN  \
                                                  | OPAMP_TCMR_TIMPGA_SEL \
                                                 )  /*!< TCMR reset all bits, except LOCK */

/* Internal mask for OPAMP trimming of transistors differential pair NMOS     */
/* or PMOS.                                                                   */
/* To select into literal LL_OPAMP_TRIMMING_x the relevant bits for:          */
/* - OPAMP trimming selection of transistors differential pair                */
/* - OPAMP trimming values of transistors differential pair                   */
#define OPAMP_TRIMMING_SELECT_MASK               (OPAMP_CSR_CALSEL)
#define OPAMP_TRIMMING_VALUE_MASK                (OPAMP_CSR_TRIMOFFSETP | OPAMP_CSR_TRIMOFFSETN)

/**
  * @}
  */


/* Exported types ------------------------------------------------------------*/

/* Exported constants --------------------------------------------------------*/
/** @defgroup OPAMP_LL_Exported_Constants LL OPAMP Constants
  * @{
  */


/** @defgroup OPAMP_LL_EC_POWERMODE OPAMP power mode
  * @{
  */

#define LL_OPAMP_POWER_MODE_NORMAL               (0x00000000U)       /*!< OPAMP power mode: normal-power */
/**
  * @}
  */

/** @defgroup OPAMP_LL_EC_SPEEDMODE OPAMP speed mode
  * @{
  */
#define LL_OPAMP_SPEED_MODE_NORMAL               (0x00000000U)       /*!< OPAMP speed mode: normal-speed */
#define LL_OPAMP_SPEED_MODE_HIGH                 (OPAMP_CSR_OPAHSM)  /*!< OPAMP speed mode: high-speed */

/**
  * @}
  */

/** @defgroup OPAMP_LL_EC_MODE OPAMP mode calibration or functional.
  * @{
  */
#define LL_OPAMP_MODE_FUNCTIONAL                 (0x00000000U)          /*!< OPAMP functional mode  */
#define LL_OPAMP_MODE_CALIBRATION                (OPAMP_CSR_CALON)      /*!< OPAMP calibration mode */
/**
  * @}
  */

/** @defgroup OPAMP_LL_EC_FUNCTIONAL_MODE OPAMP functional mode
  * @{
  */
#define LL_OPAMP_MODE_STANDALONE                 (0x00000000U)                             /*!< OPAMP functional mode,
                                                 OPAMP operation in standalone */
#define LL_OPAMP_MODE_FOLLOWER                   (OPAMP_CSR_VM_SEL_1 | OPAMP_CSR_VM_SEL_0) /*!< OPAMP functional mode,
                                                 OPAMP operation in follower */
#define LL_OPAMP_MODE_PGA                        (OPAMP_CSR_VM_SEL_1)                      /*!< OPAMP functional mode,
                                                 OPAMP operation in PGA */
/**
  * @}
  */

/** @defgroup OPAMP_LL_EC_PGA_EXT OPAMP PGA external connection mode
  * @{
  */
#define LL_OPAMP_PGA_EXT_NONE                    (0x00000000U)           /*!< In PGA mode, the inverting input is
                                                 connected to the internal feedback resistor. No external connection
                                                 on inverting input.
                                                 Positive gain (Non-Inverting mode)
                                                 - VINPx: Input signal */
#define LL_OPAMP_PGA_EXT_FILT                    (OPAMP_CSR_PGA_GAIN_4)  /*!< In PGA mode, the inverting input is
                                                 connected to the internal feedback resistor and to VINM0 for filtering.
                                                 Positive gain (Non-Inverting mode)
                                                 - VINPx: Input signal
                                                 - VINM0 - VOUT: Additional low-pass filtering */
#define LL_OPAMP_PGA_EXT_BIAS                    (OPAMP_CSR_PGA_GAIN_3)  /*!< In PGA mode, the inverting input is
                                                 connected to the internal feedback resistor. VINM0 is available
                                                 for bias voltage in non-inverting mode or to use the OPAMP in
                                                 inverting mode.
                                                 Negative gain (Inverting mode):
                                                 - VINPx: Bias voltage
                                                 - VINM0: Input signal
                                                 Positive gain (Non-Inverting mode)
                                                 - VINPx: Input signal
                                                 - VINM0: Bias voltage */
#define LL_OPAMP_PGA_EXT_BIAS_FILT               (LL_OPAMP_PGA_EXT_BIAS | LL_OPAMP_PGA_EXT_FILT) /*!< In PGA mode,
                                                 the inverting input is connected to the internal feedback resistor and
                                                 to VINM1 for filtering. VINM0 is available for bias voltage in
                                                 non-inverting mode or to use the OPAMP in inverting mode.
                                                 Negative gain (Inverting mode):
                                                 - VINPx: Bias voltage
                                                 - VINM0: Input signal
                                                 - VINM1 - VOUT: Additional low-pass
                                                   filtering
                                                 Positive gain (Non-Inverting mode)
                                                 - VINPx: Input signal
                                                 - VINM0: Bias voltage
                                                 - VINM1 - VOUT: Additional low-pass filtering */

/**
  * @}
  */

/** @defgroup OPAMP_LL_EC_MODE_PGA_GAIN OPAMP PGA gain (relevant when OPAMP is in functional mode PGA)
  * @{
  */
#define LL_OPAMP_PGA_GAIN_2                      (0x00000000UL)            /*!< OPAMP PGA gain 2  */
#define LL_OPAMP_PGA_GAIN_4                      (OPAMP_CSR_PGA_GAIN_0)    /*!< OPAMP PGA gain 4  */
#define LL_OPAMP_PGA_GAIN_8                      (OPAMP_CSR_PGA_GAIN_1)    /*!< OPAMP PGA gain 8  */
#define LL_OPAMP_PGA_GAIN_16                     (OPAMP_CSR_PGA_GAIN_1 \
                                                  | OPAMP_CSR_PGA_GAIN_0)  /*!< OPAMP PGA gain 16 */
#define LL_OPAMP_PGA_GAIN_2_OR_MINUS_1           (LL_OPAMP_PGA_GAIN_2)     /*!< OPAMP PGA gain 2  or -1  */
#define LL_OPAMP_PGA_GAIN_4_OR_MINUS_3           (LL_OPAMP_PGA_GAIN_4)     /*!< OPAMP PGA gain 4  or -3  */
#define LL_OPAMP_PGA_GAIN_8_OR_MINUS_7           (LL_OPAMP_PGA_GAIN_8)     /*!< OPAMP PGA gain 8  or -7  */
#define LL_OPAMP_PGA_GAIN_16_OR_MINUS_15         (LL_OPAMP_PGA_GAIN_16)    /*!< OPAMP PGA gain 16 or -15 */
/**
  * @}
  */

/** @defgroup OPAMP_LL_EC_INPUT_NONINVERTING OPAMP input non-inverting
  * @{
  */
#define LL_OPAMP_INPUT_NONINVERT_IO0             (0x00000000U)        /*!< OPAMP non-inverting input 0 connected to GPIO
                                                 (for GPIO mapping, refer to datasheet parameters "OPAMPx_VINP0") */
#define LL_OPAMP_INPUT_NONINVERT_IO1             (OPAMP_CSR_VP_SEL_0) /*!< OPAMP non-inverting input 1 connected to GPIO
                                                 (for GPIO mapping, refer to datasheet parameters "OPAMPx_VINP1") */
#define LL_OPAMP_INPUT_NONINVERT_IO2             (OPAMP_CSR_VP_SEL_1) /*!< OPAMP non-inverting input 2 connected to GPIO
                                                 (for GPIO mapping, refer to datasheet parameters "OPAMPx_VINP2") */
#define LL_OPAMP_INPUT_NONINVERT_DAC1_CH2        (OPAMP_CSR_VP_SEL)   /*!< OPAMP non-inverting input connected to
                                                 DAC1 channel 2 */
/**
  * @}
  */

/** @defgroup OPAMP_LL_EC_INPUT_INVERTING OPAMP input inverting
  * @{
  */
#define LL_OPAMP_INPUT_INVERT_IO0                (0x00000000U)         /*!< OPAMP inverting input connected
                                                 to GPIO pin.
                                                 Note: This OPAMP inverting input is used with OPAMP in mode standalone,
                                                       PGA with external bias or filtering, PGA with inverting gain.
                                                       In mode PGA, select LL_OPAMP_INPUT_INVERT_INT_PGA
                                                       and configure input connection,
                                                       refer to @ref LL_OPAMP_SetPGAExternalMode(). */
#define LL_OPAMP_INPUT_INVERT_IO1                (OPAMP_CSR_VM_SEL_0)  /*!< OPAMP inverting input connected
                                                 to GPIO pin. */
#define LL_OPAMP_INPUT_INVERT_INT_PGA            (OPAMP_CSR_VM_SEL_1) /*!< OPAMP inverting input connection
                                                 depending on PGA mode:
                                                 - For PGA without external bias or filtering, PGA without inverting
                                                   gain: inverting input internally connected (not connected
                                                   to a GPIO pin).
                                                 - For PGA with external bias or filtering, PGA with inverting gain:
                                                   inverting input connected to IO0 is used. To configure input
                                                   connection, refer to @ref LL_OPAMP_SetPGAExternalMode(). */
#define LL_OPAMP_INPUT_INVERT_INT_FOLLOWER       (OPAMP_CSR_VM_SEL_1 | OPAMP_CSR_VM_SEL_0) /*!< OPAMP inverting input
                                                 internally connected, intended for OPAMP in mode follower
                                                 (not connected to a GPIO pin). */
/**
  * @}
  */

/** @defgroup OPAMP_LL_EC_TRIMMING_MODE OPAMP trimming mode
  * @{
  */
#define LL_OPAMP_TRIMMING_FACTORY                (0x00000000U)      /*!< OPAMP trimming factors set to factory values */
#define LL_OPAMP_TRIMMING_USER                   (OPAMP_CSR_USERTRIM)  /*!< OPAMP trimming factors set to user values */
/**
  * @}
  */

/** @defgroup OPAMP_LL_EC_TRIMMING_TRANSISTORS_DIFF_PAIR OPAMP trimming of transistors differential pair NMOS or PMOS
  * @{
  */
#define LL_OPAMP_TRIMMING_NMOS                   (OPAMP_CSR_TRIMOFFSETN \
                                                  | OPAMP_CSR_CALSEL)     /*!< OPAMP trim for NMOS differential pairs */
#define LL_OPAMP_TRIMMING_PMOS                   (OPAMP_CSR_TRIMOFFSETP \
                                                  | OPAMP_CSR_CALSEL_0)   /*!< OPAMP trim for PMOS differential pairs */
/**
  * @}
  */

/** @defgroup OPAMP_LL_EC_HW_DELAYS  Definitions of OPAMP hardware constraints delays
  * @note   Only OPAMP IP HW delays are defined in OPAMP LL driver driver,
  *         not timeout values.
  *         For details on delays values, refer to descriptions in source code
  *         above each literal definition.
  * @{
  */

/* Delay for OPAMP startup time (transition from state disable to enable).    */
/* Note: OPAMP startup time depends on board application environment:         */
/*       impedance connected to OPAMP output.                                 */
/*       The delay below is specified under conditions:                       */
/*        - OPAMP in mode low power                                           */
/*        - OPAMP in functional mode follower                                 */
/*        - load impedance of 4kOhm (min), 50pF (max)                         */
/* Literal set to maximum value (refer to device datasheet,                   */
/* parameter "tWAKEUP").                                                      */
/* Unit: us                                                                   */
#define LL_OPAMP_DELAY_STARTUP_US                ((uint32_t) 30U)  /*!< Delay for OPAMP startup time */
/**
  * @}
  */

/** @defgroup OPAMP_LL_EC_TIM_CTRL_INPUT OPAMP Timer-controlled input selection
  * @note The switch can be controlled either by a single timer or a combination of them,
  *       in this case application has to 'ORed' the values below
  *       ex LL_OPAMP_MUX_INPUT_CTRL_TIM2_OC6 | LL_OPAMP_MUX_INPUT_CTRL_TIM2_OC4
  * @{
  */
#define LL_OPAMP_MUX_INPUT_CTRL_DISABLE         (0x00000000UL)  /*!< Timer-controlled input selection disabled */
#define LL_OPAMP_MUX_INPUT_CTRL_TIM1_OC6        (OPAMP_TCMR_TIMCM_SEL_0)   /*!< Timer-controlled input selection using
                                                                                 TIM1 OC6 */
#define LL_OPAMP_MUX_INPUT_CTRL_TIM2_OC4        (OPAMP_TCMR_TIMCM_SEL_1)   /*!< Timer-controlled input selection using
                                                                                 TIM2 OC4 */
#define LL_OPAMP_MUX_INPUT_CTRL_TIM12_OC1       (OPAMP_TCMR_TIMCM_SEL_1 \
                                                 | OPAMP_TCMR_TIMCM_SEL_0) /*!< Timer-controlled input selection using
                                                                                 TIM12 OC1 */
#define LL_OPAMP_MUX_INPUT_CTRL_TIM15_OC2       (OPAMP_TCMR_TIMCM_SEL_2)   /*!< Timer-controlled input selection using
                                                                                 TIM15 OC2 */
/**
  * @}
  */

/** @defgroup OPAMP_LL_EC_TIM_CTRL_PGA_GAIN OPAMP Timer-controlled programmable gain
  * @{
  */
#define LL_OPAMP_MUX_PGA_GAIN_CTRL_DISABLE       (0x00000000UL) /*!< Timer-controlled programmable gain
                                                                    selection disabled */
#define LL_OPAMP_MUX_PGA_GAIN_CTRL_TIM1_OC6      (OPAMP_TCMR_TIMPGA_SEL_0)   /*!< Timer-controlled programmable gain
                                                                                  selection using TIM1 OC6 */
#define LL_OPAMP_MUX_PGA_GAIN_CTRL_TIM2_OC4      (OPAMP_TCMR_TIMPGA_SEL_1)   /*!< Timer-controlled programmable gain
                                                                                  selection using TIM2 OC4 */
#define LL_OPAMP_MUX_PGA_GAIN_CTRL_TIM12_OC2     (OPAMP_TCMR_TIMPGA_SEL_1 \
                                                  | OPAMP_TCMR_TIMPGA_SEL_0) /*!< Timer-controlled programmable gain
                                                                                  selection using TIM12 OC2 */
#define LL_OPAMP_MUX_PGA_GAIN_CTRL_TIM15_OC2     (OPAMP_TCMR_TIMPGA_SEL_2)   /*!< Timer-controlled programmable gain
                                                                                  selection using TIM15 OC2 */
/**
  * @}
  */

/** @defgroup OPAMP_LL_EC_OUTPUT_CONNECTION OPAMP channel output connection
  * @{
  */
#define LL_OPAMP_OUTPUT_CONNECT_EXTERNAL         (0x00000000UL) /*!< OPAMP output connected to OPAMP_VOUT pin. */
#define LL_OPAMP_OUTPUT_CONNECT_INTERNAL         (OPAMP_CSR_OPAINTOEN) /*!< OPAMP output connected internally to
                                                                            other peripherals (ADC, COMP, ...). */
/**
  * @}
  */

/**
  * @}
  */

/* Exported macro ------------------------------------------------------------*/
/** @defgroup OPAMP_LL_Exported_Macros LL OPAMP Macros
  * @{
  */
/** @defgroup OPAMP_LL_EM_WRITE_READ Common write and read registers macro
  * @{
  */

/**
  * @brief  Write a value in OPAMP register.
  * @param  instance OPAMP Instance
  * @param  reg Register to be written
  * @param  value Value to be written in the register
  */
#define LL_OPAMP_WRITE_REG(instance, reg, value) STM32_WRITE_REG((instance)->reg, (value))

/**
  * @brief  Read a value in OPAMP register.
  * @param  instance OPAMP Instance
  * @param  reg Register to be read
  * @retval Register value
  */
#define LL_OPAMP_READ_REG(instance, reg) STM32_READ_REG((instance)->reg)

/**
  * @}
  */


/**
  * @}
  */

/* Exported functions --------------------------------------------------------*/
/** @defgroup OPAMP_LL_Exported_Functions LL OPAMP Functions
  * @{
  */


/** @defgroup OPAMP_LL_EF_CONFIGURATION_OPAMP_INSTANCE Configuration of OPAMP hierarchical scope: OPAMP instance
  * @{
  */

/**
  * @brief  Reset OPAMP CSR register, reset all bits except USERTRIM and OPA_RANGE.
  * @rmtoll
  *  CSR  OPAHSM    LL_OPAMP_ResetConfig \n
  *  CSR  CALOUT    LL_OPAMP_ResetConfig \n
  *  CSR  USERTRIM  LL_OPAMP_ResetConfig \n
  *  CSR  CALSEL    LL_OPAMP_ResetConfig \n
  *  CSR  CALON     LL_OPAMP_ResetConfig \n
  *  CSR  VP_SEL    LL_OPAMP_ResetConfig
  * @param  p_opamp OPAMP instance
  * @note   The OPAMP must be disabled to change this configuration.
  */
__STATIC_INLINE void LL_OPAMP_ResetConfig(OPAMP_TypeDef *p_opamp)
{
  /* Set OPAMP_CSR register to reset value */
  /* Mind that CSR RANGE bit of OPAMP1 remains unchanged (applies to both OPAMPs) */
  STM32_MODIFY_REG(p_opamp->CSR, (OPAMP_CSR_RESET_BITS), OPAMP_CSR_RESET_VALUE);
}

/**
  * @brief  Set OPAMP speed mode.
  * @rmtoll
  *  CSR     HSM         LL_OPAMP_SetSpeedMode
  * @param  p_opamp OPAMP instance
  * @param  speed_mode This parameter can be one of the following values:
  *         @arg @ref LL_OPAMP_SPEED_MODE_NORMAL
  *         @arg @ref LL_OPAMP_SPEED_MODE_HIGH
  * @note   The OPAMP must be disabled to change this configuration.
  */
__STATIC_INLINE void LL_OPAMP_SetSpeedMode(OPAMP_TypeDef *p_opamp, uint32_t speed_mode)
{
  STM32_MODIFY_REG(p_opamp->CSR, OPAMP_SPEED_MODE_CSR_BIT_MASK, speed_mode);
}

/**
  * @brief  Get OPAMP speed mode.
  * @rmtoll
  *  CSR     HSM      LL_OPAMP_GetSpeedMode
  * @param  p_opamp OPAMP instance
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_OPAMP_SPEED_MODE_NORMAL
  *         @arg @ref LL_OPAMP_SPEED_MODE_HIGH
  */
__STATIC_INLINE uint32_t LL_OPAMP_GetSpeedMode(const OPAMP_TypeDef *p_opamp)
{
  uint32_t speed_mode = (STM32_READ_BIT(p_opamp->CSR, OPAMP_SPEED_MODE_CSR_BIT_MASK));

  return (uint32_t)(speed_mode);
}

/**
  * @brief  Set OPAMP mode calibration or functional.
  * @rmtoll
  *  CSR      CALON         LL_OPAMP_SetMode
  * @param  p_opamp OPAMP instance
  * @param  mode This parameter can be one of the following values:
  *         @arg @ref LL_OPAMP_MODE_FUNCTIONAL
  *         @arg @ref LL_OPAMP_MODE_CALIBRATION
  * @note   OPAMP mode corresponds to functional or calibration mode:
  *          - functional mode: OPAMP operation in standalone, follower, ...
  *            Set functional mode using function
  *            @ref LL_OPAMP_SetConfigurationMode().
  *          - calibration mode: offset calibration of the selected
  *            transistors differential pair NMOS or PMOS.
  * @note   On this STM32 series, during calibration, OPAMP functional
  *         mode must be set to standalone or follower mode
  *         (in order to open internal connections to resistors of PGA mode).
  *         Refer to function @ref LL_OPAMP_SetConfigurationMode().
  */
__STATIC_INLINE void LL_OPAMP_SetMode(OPAMP_TypeDef *p_opamp, uint32_t mode)
{
  STM32_MODIFY_REG(p_opamp->CSR, OPAMP_CSR_CALON, mode);
}

/**
  * @brief  Get OPAMP mode calibration or functional.
  * @rmtoll
  *  CSR      CALON          LL_OPAMP_GetMode
  * @param  p_opamp OPAMP instance
  * @note   OPAMP mode corresponds to functional or calibration mode:
  *          - functional mode: OPAMP operation in standalone, follower, ...
  *            Set functional mode using function
  *            @ref LL_OPAMP_SetConfigurationMode().
  *          - calibration mode: offset calibration of the selected
  *            transistors differential pair NMOS or PMOS.
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_OPAMP_MODE_FUNCTIONAL
  *         @arg @ref LL_OPAMP_MODE_CALIBRATION
  */
__STATIC_INLINE uint32_t LL_OPAMP_GetMode(const OPAMP_TypeDef *p_opamp)
{
  return (uint32_t)(STM32_READ_BIT(p_opamp->CSR, OPAMP_CSR_CALON));
}

/**
  * @brief  Set OPAMP configuration mode by setting internal connections.
  * @rmtoll
  *  CSR      VM_SEL         LL_OPAMP_SetConfigurationMode
  * @param  p_opamp OPAMP instance
  * @param  mode This parameter can be one of the following values:
  *         @arg @ref LL_OPAMP_MODE_STANDALONE
  *         @arg @ref LL_OPAMP_MODE_FOLLOWER
  *         @arg @ref LL_OPAMP_MODE_PGA
  *         OPAMP operation in standalone, follower, ...
  * @note   This function reset bit of calibration mode to ensure
  *         to be in functional mode, in order to have OPAMP parameters
  *         (inputs selection, ...) set with the corresponding OPAMP mode
  *         to be effective.
  */
__STATIC_INLINE void LL_OPAMP_SetConfigurationMode(OPAMP_TypeDef *p_opamp, uint32_t mode)
{
  /* Note: Bit OPAMP_CSR_CALON reset to ensure to be in functional mode */
  STM32_MODIFY_REG(p_opamp->CSR, OPAMP_CSR_VM_SEL | OPAMP_CSR_CALON, mode);
}

