MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/ll/stm32c5xx_ll_opamp.h
/**
  * @brief  Get OPAMP configuration mode from setting of internal connections.
  *         OPAMP operation in standalone, follower, ...
  * @rmtoll
  *  CSR      VM_SEL         LL_OPAMP_GetConfigurationMode
  * @param  p_opamp OPAMP instance
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_OPAMP_MODE_STANDALONE
  *         @arg @ref LL_OPAMP_MODE_FOLLOWER
  *         @arg @ref LL_OPAMP_MODE_PGA
  */
__STATIC_INLINE uint32_t LL_OPAMP_GetConfigurationMode(const OPAMP_TypeDef *p_opamp)
{
  uint32_t tmp_csr = STM32_READ_BIT(p_opamp->CSR, OPAMP_CSR_VM_SEL);
  return (uint32_t)(((tmp_csr & OPAMP_CSR_VM_SEL_1) == 0UL) ? (LL_OPAMP_MODE_STANDALONE) : (tmp_csr));
}

/**
  * @brief  Set OPAMP PGA gain.
  * @rmtoll
  *  CSR      gain         LL_OPAMP_SetPGAGain
  * @param  p_opamp OPAMP instance
  * @param  gain This parameter can be one of the following values:
  *         @arg @ref LL_OPAMP_PGA_GAIN_2
  *         @arg @ref LL_OPAMP_PGA_GAIN_4
  *         @arg @ref LL_OPAMP_PGA_GAIN_8
  *         @arg @ref LL_OPAMP_PGA_GAIN_16
  *         @arg @ref LL_OPAMP_PGA_GAIN_2_OR_MINUS_1
  *         @arg @ref LL_OPAMP_PGA_GAIN_4_OR_MINUS_3
  *         @arg @ref LL_OPAMP_PGA_GAIN_8_OR_MINUS_7
  *         @arg @ref LL_OPAMP_PGA_GAIN_16_OR_MINUS_15
  * @note   Preliminarily, OPAMP must be set in mode PGA
  *         using function @ref LL_OPAMP_SetConfigurationMode().
  */
__STATIC_INLINE void LL_OPAMP_SetPGAGain(OPAMP_TypeDef *p_opamp, uint32_t gain)
{
  STM32_MODIFY_REG(p_opamp->CSR, (OPAMP_CSR_PGA_GAIN_1 | OPAMP_CSR_PGA_GAIN_0), gain);
}

/**
  * @brief  Get OPAMP PGA gain.
  * @rmtoll
  *  CSR      PGA_GAIN         LL_OPAMP_GetPGAGain
  * @param  p_opamp OPAMP instance
  * @note   Preliminarily, OPAMP must be set in mode PGA
  *         using function @ref LL_OPAMP_SetConfigurationMode().
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_OPAMP_PGA_GAIN_2
  *         @arg @ref LL_OPAMP_PGA_GAIN_4
  *         @arg @ref LL_OPAMP_PGA_GAIN_8
  *         @arg @ref LL_OPAMP_PGA_GAIN_16
  *         @arg @ref LL_OPAMP_PGA_GAIN_2_OR_MINUS_1
  *         @arg @ref LL_OPAMP_PGA_GAIN_4_OR_MINUS_3
  *         @arg @ref LL_OPAMP_PGA_GAIN_8_OR_MINUS_7
  *         @arg @ref LL_OPAMP_PGA_GAIN_16_OR_MINUS_15
  */
__STATIC_INLINE uint32_t LL_OPAMP_GetPGAGain(const OPAMP_TypeDef *p_opamp)
{
  return (uint32_t)(STM32_READ_BIT(p_opamp->CSR, (OPAMP_CSR_PGA_GAIN_1 | OPAMP_CSR_PGA_GAIN_0)));
}

/**
  * @brief  Set OPAMP PGA external connection configuration.
  * @rmtoll
  *  CSR      PGA_GAIN         LL_OPAMP_SetPGAExternalMode
  * @param  p_opamp OPAMP instance
  * @param  mode This parameter can be one of the following values:
  *         @arg @ref LL_OPAMP_PGA_EXT_NONE
  *         @arg @ref LL_OPAMP_PGA_EXT_FILT
  *         @arg @ref LL_OPAMP_PGA_EXT_BIAS
  *         @arg @ref LL_OPAMP_PGA_EXT_BIAS_FILT
  * @note   Preliminarily, OPAMP must be set in mode PGA
  *         using function @ref LL_OPAMP_SetConfigurationMode().
  */
__STATIC_INLINE void LL_OPAMP_SetPGAExternalMode(OPAMP_TypeDef *p_opamp, uint32_t mode)
{
  STM32_MODIFY_REG(p_opamp->CSR, (OPAMP_CSR_PGA_GAIN_4 | OPAMP_CSR_PGA_GAIN_3), mode);
}

/**
  * @brief  Get OPAMP PGA external connection configuration.
  * @rmtoll
  *  CSR      PGA_GAIN         LL_OPAMP_GetPGAExternalMode
  * @param  p_opamp OPAMP instance
  * @note   Preliminarily, OPAMP must be set in mode PGA
  *         using function @ref LL_OPAMP_SetConfigurationMode().
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_OPAMP_PGA_EXT_NONE
  *         @arg @ref LL_OPAMP_PGA_EXT_FILT
  *         @arg @ref LL_OPAMP_PGA_EXT_BIAS
  *         @arg @ref LL_OPAMP_PGA_EXT_BIAS_FILT
  */
__STATIC_INLINE uint32_t LL_OPAMP_GetPGAExternalMode(const OPAMP_TypeDef *p_opamp)
{
  return (uint32_t)(STM32_READ_BIT(p_opamp->CSR, (OPAMP_CSR_PGA_GAIN_4 | OPAMP_CSR_PGA_GAIN_3)));
}

/**
  * @brief  Set OPAMP in one time configuration parameters.
  * @rmtoll
  *  CSR      CALON         LL_OPAMP_SetConfig \n
  *  CSR      OPAMODE       LL_OPAMP_SetConfig \n
  *  CSR      OPALPM        LL_OPAMP_SetConfig \n
  *  CSR      HSM           LL_OPAMP_SetConfig \n
  *  CSR      OPAINTOEN     LL_OPAMP_SetConfig \n
  *  CSR      VM_SEL        LL_OPAMP_SetConfig \n
  *  CSR      VP_SEL        LL_OPAMP_SetConfig
  * @param  p_opamp OPAMP instance
  * @param  reg_value This parameter is a concatenation of bits CALON,
  *                   HSM,
  *                   VM_SEL, VP_SEL
  * @note   Preliminarily, OPAMP must be disabled.
  */
__STATIC_INLINE void LL_OPAMP_SetConfig(OPAMP_TypeDef *p_opamp, uint32_t reg_value)
{
  STM32_MODIFY_REG(p_opamp->CSR,
                   (OPAMP_CSR_CALON           /* Functional mode */
                    | OPAMP_CSR_OPAHSM        /* High speed mode */
                    | OPAMP_CSR_VM_SEL        /* Inverting input */
                    | OPAMP_CSR_VP_SEL        /* Non-inverting input */
                    | OPAMP_CSR_OPAINTOEN     /* Output connection */
                   ),
                   reg_value);
}

/**
  * @brief  Get OPAMP configuration parameters bit fields.
  * @rmtoll
  *  CSR      CALON         LL_OPAMP_GetConfig \n
  *  CSR      OPAMODE       LL_OPAMP_GetConfig \n
  *  CSR      OPALPM        LL_OPAMP_GetConfig \n
  *  CSR      HSM           LL_OPAMP_GetConfig \n
  *  CSR      OPAINTOEN     LL_OPAMP_SetConfig \n
  *  CSR      VM_SEL        LL_OPAMP_GetConfig \n
  *  CSR      VP_SEL        LL_OPAMP_GetConfig
  * @param  p_opamp OPAMP instance
  * @retval Returned value is the concatenation of bits CALON,
  *         HSM,
  *         VM_SEL, VP_SEL
  */
__STATIC_INLINE uint32_t LL_OPAMP_GetConfig(const OPAMP_TypeDef *p_opamp)
{
  return (uint32_t)STM32_READ_BIT(p_opamp->CSR,
                                  (OPAMP_CSR_CALON           /* Functional mode */
                                   | OPAMP_CSR_OPAHSM        /* High speed mode */
                                   | OPAMP_CSR_VM_SEL        /* Inverting input */
                                   | OPAMP_CSR_VP_SEL        /* Non-inverting input */
                                   | OPAMP_CSR_OPAINTOEN     /* Output connection */
                                  ));
}

/**
  * @}
  */

/** @defgroup OPAMP_LL_EF_CONFIGURATION_INPUTS Configuration of OPAMP inputs
  * @{
  */

/**
  * @brief  Set OPAMP non-inverting input connection.
  * @rmtoll
  *  CSR      VPSEL          LL_OPAMP_SetInputNonInverting
  * @param  p_opamp OPAMP instance
  * @param  input_non_inverting This parameter can be one of the following values:
  *         @arg @ref LL_OPAMP_INPUT_NONINVERT_IO0
  *         @arg @ref LL_OPAMP_INPUT_NONINVERT_IO1
  *         @arg LL_OPAMP_INPUT_NONINVERT_IO2 (1)
  *         @arg LL_OPAMP_INPUT_NONINVERT_DAC1_CH2 (1)
  *         @arg LL_OPAMP_INPUT_NONINVERT_DAC2_CH1 (2)(3)
  *         @arg LL_OPAMP_INPUT_NONINVERT_DAC2_CH2 (2)
  *
  *         - (1) Parameters only available on STM32C542xx/532xx devices
  *         - (2) Parameters only available on STM32C5P1xx/5Q1xx devices
  *         - (3) Parameters only available on STM32C5J1xx/5K1xx devices
  */
__STATIC_INLINE void LL_OPAMP_SetInputNonInverting(OPAMP_TypeDef *p_opamp, uint32_t input_non_inverting)
{
  STM32_MODIFY_REG(p_opamp->CSR, OPAMP_CSR_VP_SEL, input_non_inverting);
}

/**
  * @brief  Get OPAMP non-inverting input connection.
  * @rmtoll
  *  CSR      VPSEL          LL_OPAMP_GetInputNonInverting
  * @param  p_opamp OPAMP instance
  * @retval Returned value can be one of the following values:
  *         This parameter can be one of the following values:
  *         @arg @ref LL_OPAMP_INPUT_NONINVERT_IO0
  *         @arg @ref LL_OPAMP_INPUT_NONINVERT_IO1
  *         @arg LL_OPAMP_INPUT_NONINVERT_IO2 (1)
  *         @arg LL_OPAMP_INPUT_NONINVERT_DAC1_CH2 (1)
  *         @arg LL_OPAMP_INPUT_NONINVERT_DAC2_CH1 (2)(3)
  *         @arg LL_OPAMP_INPUT_NONINVERT_DAC2_CH2 (2)
  *
  *         - (1) Parameters only available on STM32C542xx/532xx devices
  *         - (2) Parameters only available on STM32C5P1xx/5Q1xx devices
  *         - (3) Parameters only available on STM32C5J1xx/5K1xx devices
  */
__STATIC_INLINE uint32_t LL_OPAMP_GetInputNonInverting(const OPAMP_TypeDef *p_opamp)
{
  return (uint32_t)(STM32_READ_BIT(p_opamp->CSR, OPAMP_CSR_VP_SEL));
}

/**
  * @brief  Set OPAMP inverting input connection.
  * @rmtoll
  *  CSR      VMSEL          LL_OPAMP_SetInputInverting
  * @param  p_opamp OPAMP instance
  * @param  input_inverting This parameter can be one of the following values:
  *         @arg @ref LL_OPAMP_INPUT_INVERT_IO0
  *         @arg @ref LL_OPAMP_INPUT_INVERT_IO1
  *         @arg @ref LL_OPAMP_INPUT_INVERT_INT_PGA
  *         @arg @ref LL_OPAMP_INPUT_INVERT_INT_FOLLOWER
  * @note   OPAMP inverting input is used with OPAMP in mode standalone
  *         or PGA with external capacitors for filtering circuit.
  *         Otherwise (OPAMP in mode follower), OPAMP inverting input
  *         is not used (not connected to GPIO pin).
  */
__STATIC_INLINE void LL_OPAMP_SetInputInverting(OPAMP_TypeDef *p_opamp, uint32_t input_inverting)
{
  STM32_MODIFY_REG(p_opamp->CSR, OPAMP_CSR_VM_SEL, input_inverting);
}

/**
  * @brief  Get OPAMP inverting input connection.
  * @rmtoll
  *  CSR      VMSEL          LL_OPAMP_GetInputInverting
  * @param  p_opamp OPAMP instance
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_OPAMP_INPUT_INVERT_IO0
  *         @arg @ref LL_OPAMP_INPUT_INVERT_IO1
  *         @arg @ref LL_OPAMP_INPUT_INVERT_INT_PGA
  *         @arg @ref LL_OPAMP_INPUT_INVERT_INT_FOLLOWER
  */
__STATIC_INLINE uint32_t LL_OPAMP_GetInputInverting(const OPAMP_TypeDef *p_opamp)
{
  return (uint32_t)(STM32_READ_BIT(p_opamp->CSR, OPAMP_CSR_VM_SEL));
}

/**
  * @brief  Set OPAMP both inverting input and non-inverting input connections.
  * @rmtoll
  *  CSR      VPSEL          LL_OPAMP_SetInputs \n
  *  CSR      VMSEL          LL_OPAMP_SetInputs
  * @param  p_opamp OPAMP instance
  * @param  input_non_inverting This parameter can be one of the following values:
  *         @arg @ref LL_OPAMP_INPUT_NONINVERT_IO0
  *         @arg @ref LL_OPAMP_INPUT_NONINVERT_IO1
  *         @arg LL_OPAMP_INPUT_NONINVERT_IO2 (1)
  *         @arg LL_OPAMP_INPUT_NONINVERT_DAC1_CH2 (1)
  *         @arg LL_OPAMP_INPUT_NONINVERT_DAC2_CH1 (2)(3)
  *         @arg LL_OPAMP_INPUT_NONINVERT_DAC2_CH2 (2)
  *
  *         - (1) Parameters only available on STM32C542xx/532xx devices
  *         - (2) Parameters only available on STM32C5P1xx/5Q1xx devices
  *         - (3) Parameters only available on STM32C5J1xx/5K1xx devices
  * @param  input_inverting This parameter can be one of the following values:
  *         @arg @ref LL_OPAMP_INPUT_INVERT_IO0
  *         @arg @ref LL_OPAMP_INPUT_INVERT_IO1
  *         @arg @ref LL_OPAMP_INPUT_INVERT_INT_PGA
  *         @arg @ref LL_OPAMP_INPUT_INVERT_INT_FOLLOWER
  * @note   OPAMP inverting input is used with OPAMP in mode standalone
  *         or PGA with external capacitors for filtering circuit.
  *         Otherwise (OPAMP in mode follower), OPAMP inverting input
  *         is not used (not connected to GPIO pin).
  */
__STATIC_INLINE void LL_OPAMP_SetInputs(OPAMP_TypeDef *p_opamp,
                                        uint32_t input_non_inverting, uint32_t input_inverting)
{
  STM32_MODIFY_REG(p_opamp->CSR, (OPAMP_CSR_VP_SEL | OPAMP_CSR_VM_SEL), (input_non_inverting | input_inverting));
}

/**
  * @brief  Get OPAMP both non-inverting input and inverting input connection.
  * @rmtoll
  *  CSR      VPSEL          LL_OPAMP_GetInputs \n
  *  CSR      VMSEL          LL_OPAMP_GetInputs
  * @param  p_opamp OPAMP instance
  * @retval Returned value is inverting input and non-inverting input both contained in an uint32_t.
  *         This bit field contains the following values inside the [31,0] bit field:
  *         VP_SEL bit [3,2]
  *         VM_SEL bit [6,5]
  *         Those parameters can be one of the following values
  *         for VP_SEL:
  *         @arg @ref LL_OPAMP_INPUT_NONINVERT_IO0
  *         @arg @ref LL_OPAMP_INPUT_NONINVERT_IO1
  *         @arg LL_OPAMP_INPUT_NONINVERT_IO2 (1)
  *         @arg LL_OPAMP_INPUT_NONINVERT_DAC1_CH2 (1)
  *         @arg LL_OPAMP_INPUT_NONINVERT_DAC2_CH1 (2)(3)
  *         @arg LL_OPAMP_INPUT_NONINVERT_DAC2_CH2 (2)
  *
  *         - (1) Parameters only available on STM32C542xx/532xx devices
  *         - (2) Parameters only available on STM32C5P1xx/5Q1xx devices
  *         - (3) Parameters only available on STM32C5J1xx/5K1xx devices
  *         for VM_SEL:
  *         @arg @ref LL_OPAMP_INPUT_INVERT_IO0
  *         @arg @ref LL_OPAMP_INPUT_INVERT_IO1
  *         @arg @ref LL_OPAMP_INPUT_INVERT_INT_PGA
  *         @arg @ref LL_OPAMP_INPUT_INVERT_INT_FOLLOWER
  */
__STATIC_INLINE uint32_t LL_OPAMP_GetInputs(const OPAMP_TypeDef *p_opamp)
{
  return (uint32_t)(STM32_READ_BIT(p_opamp->CSR, (OPAMP_CSR_VP_SEL | OPAMP_CSR_VM_SEL)));
}
/**
  * @}
  */

/** @defgroup OPAMP_LL_EF_OPAMP_TRIMMING Configuration and operation of OPAMP trimming
  * @{
  */

/**
  * @brief  Set OPAMP trimming mode.
  * @rmtoll
  *  CSR      USERTRIM       LL_OPAMP_SetTrimmingMode
  * @param  p_opamp OPAMP instance
  * @param  trimming_mode This parameter can be one of the following values:
  *         @arg @ref LL_OPAMP_TRIMMING_FACTORY
  *         @arg @ref LL_OPAMP_TRIMMING_USER
  */
__STATIC_INLINE void LL_OPAMP_SetTrimmingMode(OPAMP_TypeDef *p_opamp, uint32_t trimming_mode)
{
  STM32_MODIFY_REG(p_opamp->CSR, OPAMP_CSR_USERTRIM, trimming_mode);
}

/**
  * @brief  Get OPAMP trimming mode.
  * @rmtoll
  *  CSR      USERTRIM       LL_OPAMP_GetTrimmingMode
  * @param  p_opamp OPAMP instance
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_OPAMP_TRIMMING_FACTORY
  *         @arg @ref LL_OPAMP_TRIMMING_USER
  */
__STATIC_INLINE uint32_t LL_OPAMP_GetTrimmingMode(const OPAMP_TypeDef *p_opamp)
{
  return (uint32_t)(STM32_READ_BIT(p_opamp->CSR, OPAMP_CSR_USERTRIM));
}

/**
  * @brief  Set OPAMP offset to calibrate the selected transistors
  *         differential pair NMOS or PMOS.
  * @rmtoll
  *  CSR      CALSEL         LL_OPAMP_SetCalibrationSelection
  * @param  p_opamp OPAMP instance
  * @param  transistors_diff_pair This parameter can be one of the following values:
  *         @arg @ref LL_OPAMP_TRIMMING_NMOS
  *         @arg @ref LL_OPAMP_TRIMMING_PMOS
  * @note   Preliminarily, OPAMP must be set in mode calibration
  *         using function @ref LL_OPAMP_SetMode().
  */
__STATIC_INLINE void LL_OPAMP_SetCalibrationSelection(OPAMP_TypeDef *p_opamp, uint32_t transistors_diff_pair)
{
  /* Parameter used with mask "OPAMP_TRIMMING_SELECT_MASK" because            */
  /* containing other bits reserved for other purpose.                        */
  STM32_MODIFY_REG(p_opamp->CSR, OPAMP_CSR_CALSEL, (transistors_diff_pair & OPAMP_TRIMMING_SELECT_MASK));
}

/**
  * @brief  Get OPAMP offset to calibrate the selected transistors
  *         differential pair NMOS or PMOS.
  * @rmtoll
  *  CSR      CALSEL         LL_OPAMP_GetCalibrationSelection
  * @param  p_opamp OPAMP instance
  * @note   Preliminarily, OPAMP must be set in mode calibration
  *         using function @ref LL_OPAMP_SetMode().
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_OPAMP_TRIMMING_NMOS
  *         @arg @ref LL_OPAMP_TRIMMING_PMOS
  */
__STATIC_INLINE uint32_t LL_OPAMP_GetCalibrationSelection(const OPAMP_TypeDef *p_opamp)
{
  uint32_t calib_sel = (uint32_t)(STM32_READ_BIT(p_opamp->CSR, OPAMP_CSR_CALSEL));

