MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/ll/stm32c5xx_ll_opamp.h
  return (calib_sel | (((calib_sel & OPAMP_CSR_CALSEL_1) == 0UL) ? LL_OPAMP_TRIMMING_PMOS : LL_OPAMP_TRIMMING_NMOS));
}

/**
  * @brief  Get OPAMP calibration result of toggling output.
  * @rmtoll
  *  CSR      CALOUT         LL_OPAMP_IsCalibrationOutputSet
  * @param  p_opamp OPAMP instance
  * @retval 1 If the offset is not enough compensated with the current trim offset value.
  * @retval 0 If the offset is enough compensated.
  * @note Returned value is not related to CALOUT flag value: intended to monitor
  *       CALOUT flag transition and state corresponding to calibration completed
  *       (refer to calibration procedure in reference manual).
  */
__STATIC_INLINE uint32_t LL_OPAMP_IsCalibrationOutputSet(const OPAMP_TypeDef *p_opamp)
{
  return ((STM32_READ_BIT(p_opamp->CSR, OPAMP_CSR_CALOUT) == OPAMP_CSR_CALOUT) ? 0UL : 1UL);
}

/**
  * @brief  Set OPAMP trimming factor for the selected transistors
  *         differential pair NMOS or PMOS, corresponding to the selected
  *         power mode.
  * @rmtoll
  *  CSR      TRIMOFFSETN    LL_OPAMP_SetTrimmingValue \n
  *  CSR      TRIMOFFSETP    LL_OPAMP_SetTrimmingValue
  * @param  p_opamp OPAMP instance
  * @param  power_mode This parameter can be one of the following values:
  *         @arg @ref LL_OPAMP_POWER_MODE_NORMAL(1)
  *         (1) Parameter unused for this function on this series, kept for compatibility purpose
  * @param  transistors_diff_pair This parameter can be one of the following values:
  *         @arg @ref LL_OPAMP_TRIMMING_NMOS
  *         @arg @ref LL_OPAMP_TRIMMING_PMOS
  * @param  trimming_value 0x01...0x1F
  */
__STATIC_INLINE void LL_OPAMP_SetTrimmingValue(OPAMP_TypeDef *p_opamp, uint32_t power_mode,
                                               uint32_t transistors_diff_pair, uint32_t trimming_value)
{
  /* Prevent unused argument(s) compilation warning */
  (void)(power_mode);

  __IO uint32_t *preg = &(p_opamp->CSR);

  /* Set bits with position in register depending on parameter                */
  /* "transistors_diff_pair".                                                 */
  /* Parameter used with mask "OPAMP_TRIMMING_VALUE_MASK" because             */
  /* containing other bits reserved for other purpose.                        */
  STM32_MODIFY_REG(*preg,
                   (transistors_diff_pair & OPAMP_TRIMMING_VALUE_MASK),
                   (trimming_value << ((transistors_diff_pair == LL_OPAMP_TRIMMING_NMOS) ?
                                       OPAMP_CSR_TRIMOFFSETN_Pos : OPAMP_CSR_TRIMOFFSETP_Pos))
                  );
}

/**
  * @brief  Get OPAMP trimming factor for the selected transistors
  *         differential pair NMOS or PMOS, corresponding to the selected
  *         power mode.
  * @rmtoll
  *  CSR      TRIMOFFSETN    LL_OPAMP_GetTrimmingValue \n
  *  CSR      TRIMOFFSETP    LL_OPAMP_GetTrimmingValue
  * @param  p_opamp OPAMP instance
  * @param  power_mode This parameter can be one of the following values:
  *         @arg @ref LL_OPAMP_POWER_MODE_NORMAL(1)
  *         (1) Parameter unused for this function on this series, kept for compatibility purpose
  * @param  transistors_diff_pair This parameter can be one of the following values:
  *         @arg @ref LL_OPAMP_TRIMMING_NMOS
  *         @arg @ref LL_OPAMP_TRIMMING_PMOS
  * @retval 0x1...0x1F
  */
__STATIC_INLINE uint32_t LL_OPAMP_GetTrimmingValue(const OPAMP_TypeDef *p_opamp, uint32_t power_mode,
                                                   uint32_t transistors_diff_pair)
{
  /* Prevent unused argument(s) compilation warning */
  (void)(power_mode);

  const __IO uint32_t *preg = &(p_opamp->CSR);

  /* Retrieve bits with position in register depending on parameter           */
  /* "transistors_diff_pair".                                                 */
  /* Parameter used with mask "OPAMP_TRIMMING_VALUE_MASK" because             */
  /* containing other bits reserved for other purpose.                        */
  return (uint32_t)(STM32_READ_BIT(*preg, (transistors_diff_pair & OPAMP_TRIMMING_VALUE_MASK))
                    >> ((transistors_diff_pair == LL_OPAMP_TRIMMING_NMOS) ?
                        OPAMP_CSR_TRIMOFFSETN_Pos : OPAMP_CSR_TRIMOFFSETP_Pos)
                   );
}

/**
  * @brief  Set OPAMP trimming factor for the selected transistors
  *         differential pair NMOS or PMOS, corresponding to the selected
  *         power mode.
  * @rmtoll
  *  CSR      TRIMOFFSETN    LL_OPAMP_SetOffsetTrimValue \n
  *  CSR      TRIMOFFSETP    LL_OPAMP_SetOffsetTrimValue
  * @param  p_opamp OPAMP instance
  * @param  power_mode This parameter can be one of the following values:
  *         @arg @ref LL_OPAMP_POWER_MODE_NORMAL(1)
  *         (1) Parameter unused for this function on this series, kept for compatibility purpose
  * @param  transistors_diff_pair This parameter can be one of the following values:
  *         @arg @ref LL_OPAMP_TRIMMING_NMOS
  *         @arg @ref LL_OPAMP_TRIMMING_PMOS
  * @param  trimming_value 0x01...0x1F
  */
__STATIC_INLINE void LL_OPAMP_SetOffsetTrimValue(OPAMP_TypeDef *p_opamp, uint32_t power_mode,
                                                 uint32_t transistors_diff_pair, uint32_t trimming_value)
{
  /* Prevent unused argument(s) compilation warning */
  (void)(power_mode);

  __IO uint32_t *preg = &(p_opamp->CSR);

  /* Set bits with position in register depending on parameter    */
  /* "transistors_diff_pair".                                     */
  /* Parameter used with mask "OPAMP_TRIMMING_VALUE_MASK" because */
  /* containing other bits reserved for other purpose.            */
  STM32_MODIFY_REG(*preg,
                   (transistors_diff_pair & OPAMP_TRIMMING_VALUE_MASK),
                   (trimming_value << ((transistors_diff_pair == LL_OPAMP_TRIMMING_NMOS) ?
                                       OPAMP_CSR_TRIMOFFSETN_Pos : OPAMP_CSR_TRIMOFFSETP_Pos
                                      ))
                  );
}

/**
  * @brief  Get OPAMP trimming factor for the selected transistors
  *         differential pair NMOS or PMOS, corresponding to the selected
  *         power mode.
  * @rmtoll
  *  CSR      TRIMOFFSETN    LL_OPAMP_GetOffsetTrimValue \n
  *  CSR      TRIMOFFSETP    LL_OPAMP_GetOffsetTrimValue
  * @param  p_opamp OPAMP instance
  * @param  power_mode This parameter can be one of the following values:
  *         @arg @ref LL_OPAMP_POWER_MODE_NORMAL(1)
  *         (1) Parameter unused for this function on this series, kept for compatibility purpose
  * @param  transistors_diff_pair This parameter can be one of the following values:
  *         @arg @ref LL_OPAMP_TRIMMING_NMOS
  *         @arg @ref LL_OPAMP_TRIMMING_PMOS
  * @retval 0x1...0x1F
  */
__STATIC_INLINE uint32_t LL_OPAMP_GetOffsetTrimValue(const OPAMP_TypeDef *p_opamp, uint32_t power_mode,
                                                     uint32_t transistors_diff_pair)
{
  /* Prevent unused argument(s) compilation warning */
  (void)(power_mode);

  const __IO uint32_t *preg = &(p_opamp->CSR);

  /* Retrieve bits with position in register depending on parameter */
  /* "transistors_diff_pair".                                       */
  /* Parameter used with mask "OPAMP_TRIMMING_VALUE_MASK" because   */
  /* containing other bits reserved for other purpose.              */
  return (uint32_t)(STM32_READ_BIT(*preg, (transistors_diff_pair & OPAMP_TRIMMING_VALUE_MASK))
                    >> ((transistors_diff_pair == LL_OPAMP_TRIMMING_NMOS) ?
                        OPAMP_CSR_TRIMOFFSETN_Pos : OPAMP_CSR_TRIMOFFSETP_Pos
                       )
                   );
}

/**
  * @brief  Set OPAMP all differential pair trimming (PMOS and NMOS) values for the selected power mode.
  * @rmtoll
  *  CSR      TRIMOFFSETN    LL_OPAMP_SetOffsetTrimAllValue \n
  *  CSR      TRIMOFFSETP    LL_OPAMP_SetOffsetTrimAllValue
  * @param  p_opamp OPAMP instance
  * @param  power_mode This parameter can be one of the following values:
  *         @arg @ref LL_OPAMP_POWER_MODE_NORMAL(1)
  *         (1) Parameter unused for this function on this series, kept for compatibility purpose
  * @param  p_trim_value 0x01...0x1F
  * @param  n_trim_value 0x01...0x1F
  */
__STATIC_INLINE void LL_OPAMP_SetOffsetTrimAllValue(OPAMP_TypeDef *p_opamp, uint32_t power_mode,
                                                    uint32_t p_trim_value, uint32_t n_trim_value)
{
  /* Prevent unused argument(s) compilation warning */
  (void)(power_mode);

