MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/ll/stm32c5xx_ll_opamp.h
  __IO uint32_t *preg = &(p_opamp->CSR);

  /* Set bits in register OTR or LPOTR depending on parameter power_mode */
  STM32_MODIFY_REG(*preg,
                   OPAMP_TRIMMING_VALUE_MASK,
                   ((((p_trim_value) << OPAMP_CSR_TRIMOFFSETP_Pos) | ((n_trim_value) << OPAMP_CSR_TRIMOFFSETN_Pos))
                    & (OPAMP_TRIMMING_VALUE_MASK)
                   )
                  );
}

/**
  * @brief  Get OPAMP PMOS and NMOS differential pair trimming values for the selected power mode.
  * @rmtoll
  *  CSR      TRIMOFFSETN    LL_OPAMP_GetOffsetTrimAllValue \n
  *  CSR      TRIMOFFSETP    LL_OPAMP_GetOffsetTrimAllValue
  * @param  p_opamp OPAMP instance
  * @param  power_mode This parameter can be one of the following values:
  *         @arg @ref LL_OPAMP_POWER_MODE_NORMAL(1)
  *         (1) Parameter unused for this function on this series, kept for compatibility purpose
  * @retval Concatenation of trimming values (value range 32 bits),
  *         each value corresponding to register bitfield PMOS and NMOS differential pair
  */
__STATIC_INLINE uint32_t LL_OPAMP_GetOffsetTrimAllValue(const OPAMP_TypeDef *p_opamp, uint32_t power_mode)
{
  /* Prevent unused argument(s) compilation warning */
  (void)(power_mode);

  const __IO uint32_t *preg = &(p_opamp->CSR);

  /* Retrieve bits with position in register depending on parameter           */
  /* "transistors_diff_pair".                                                 */
  /* Parameter used with mask "OPAMP_TRIMMING_VALUE_MASK" because             */
  /* containing other bits reserved for other purpose.                        */
  return (uint32_t)(STM32_READ_BIT(*preg, (OPAMP_TRIMMING_VALUE_MASK)));
}

/**
  * @}
  */

/** @defgroup OPAMP_LL_EF_OPERATION Operation on OPAMP instance
  * @{
  */
/**
  * @brief  Enable OPAMP instance.
  * @rmtoll
  *  CSR      OPAEN          LL_OPAMP_Enable
  * @param  p_opamp OPAMP instance
  * @note   After enable from off state, OPAMP requires a delay
  *         to fulfill wake up time specification.
  *         Refer to device datasheet, parameter "tWAKEUP".
  */
__STATIC_INLINE void LL_OPAMP_Enable(OPAMP_TypeDef *p_opamp)
{
  STM32_SET_BIT(p_opamp->CSR, OPAMP_CSR_OPAEN);
}

/**
  * @brief  Disable OPAMP instance.
  * @rmtoll
  *  CSR      OPAEN          LL_OPAMP_Disable
  * @param  p_opamp OPAMP instance
  */
__STATIC_INLINE void LL_OPAMP_Disable(OPAMP_TypeDef *p_opamp)
{
  STM32_CLEAR_BIT(p_opamp->CSR, OPAMP_CSR_OPAEN);
}

/**
  * @brief  Get OPAMP instance enable state.
  * @rmtoll
  *  CSR      OPAEN          LL_OPAMP_IsEnabled
  * @param  p_opamp OPAMP instance
  * @retval 1 if OPAMP is enabled.
  * @retval 0 if OPAMP is disabled.
  */
__STATIC_INLINE uint32_t LL_OPAMP_IsEnabled(const OPAMP_TypeDef *p_opamp)
{
  return ((STM32_READ_BIT(p_opamp->CSR, OPAMP_CSR_OPAEN) == (OPAMP_CSR_OPAEN)) ? 1UL : 0UL);
}

/**
  * @brief  Set OPAMP non-inverting input secondary connection.
  * @rmtoll
  *  TCMR     VPSSEL         LL_OPAMP_SetInputMuxNonInvertingSecondary
  * @param  p_opamp OPAMP instance
  * @param  input_non_inverting_sec This parameter can be one of the following values:
  *         @arg @ref LL_OPAMP_INPUT_NONINVERT_IO0
  *         @arg @ref LL_OPAMP_INPUT_NONINVERT_IO1
  *         @arg LL_OPAMP_INPUT_NONINVERT_IO2 (1)
  *         @arg LL_OPAMP_INPUT_NONINVERT_DAC1_CH2 (1)
  *         @arg LL_OPAMP_INPUT_NONINVERT_DAC2_CH1 (2)(3)
  *         @arg LL_OPAMP_INPUT_NONINVERT_DAC2_CH2 (2)
  *
  *         - (1) Parameters only available on STM32C542xx/532xx devices
  *         - (2) Parameters only available on STM32C5P1xx/5Q1xx devices
  *         - (3) Parameters only available on STM32C5J1xx/5K1xx devices
  */
__STATIC_INLINE void LL_OPAMP_SetInputMuxNonInvertingSecondary(OPAMP_TypeDef *p_opamp, uint32_t input_non_inverting_sec)
{
  STM32_MODIFY_REG(p_opamp->TCMR, OPAMP_TCMR_VPS_SEL, input_non_inverting_sec >> 1UL);
}

/**
  * @brief  Get OPAMP non-inverting input secondary connection.
  * @rmtoll
  *  TCMR     VPSSEL         LL_OPAMP_GetInputMuxNonInvertingSecondary
  * @param  p_opamp OPAMP instance
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_OPAMP_INPUT_NONINVERT_IO0
  *         @arg @ref LL_OPAMP_INPUT_NONINVERT_IO1
  *         @arg LL_OPAMP_INPUT_NONINVERT_IO2 (1)
  *         @arg LL_OPAMP_INPUT_NONINVERT_DAC1_CH2 (1)
  *         @arg LL_OPAMP_INPUT_NONINVERT_DAC2_CH1 (2)(3)
  *         @arg LL_OPAMP_INPUT_NONINVERT_DAC2_CH2 (2)
  *
  *         - (1) Parameters only available on STM32C542xx/532xx devices
  *         - (2) Parameters only available on STM32C5P1xx/5Q1xx devices
  *         - (3) Parameters only available on STM32C5J1xx/5K1xx devices
  */
__STATIC_INLINE uint32_t LL_OPAMP_GetInputMuxNonInvertingSecondary(const OPAMP_TypeDef *p_opamp)
{
  return (uint32_t)(STM32_READ_BIT(p_opamp->TCMR, OPAMP_TCMR_VPS_SEL) << 1UL);
}

/**
  * @brief  Set OPAMP inverting input secondary connection.
  * @rmtoll
  *  TCMR     VMSSEL         LL_OPAMP_SetInputMuxInvertingSecondary
  * @param  p_opamp OPAMP instance
  * @param  input_inverting_sec This parameter can be one of the following values:
  *         @arg @ref LL_OPAMP_INPUT_INVERT_IO0
  *         @arg @ref LL_OPAMP_INPUT_INVERT_IO1
  *         @arg @ref LL_OPAMP_INPUT_INVERT_INT_PGA
  *         @arg @ref LL_OPAMP_INPUT_INVERT_INT_FOLLOWER
  * @note   OPAMP inverting input is used with OPAMP in mode standalone
  *         or PGA with external capacitors for filtering circuit.
  *         Otherwise (OPAMP in mode follower), OPAMP inverting input
  *         is not used (not connected to GPIO pin).
  * @note   Timer-controlled secondary mode has constraints from timer-controlled primary mode,
  *         therefore function @ref LL_OPAMP_SetConfigurationMode() must be called prior to this function.
  */
__STATIC_INLINE void LL_OPAMP_SetInputMuxInvertingSecondary(OPAMP_TypeDef *p_opamp, uint32_t input_inverting_sec)
{
  STM32_MODIFY_REG(p_opamp->TCMR, OPAMP_TCMR_VMS_SEL,
                   (((input_inverting_sec == LL_OPAMP_INPUT_INVERT_IO1)
                     || (input_inverting_sec == LL_OPAMP_INPUT_INVERT_INT_FOLLOWER)) ? 1UL : 0UL));
}

/**
  * @brief  Get OPAMP inverting input secondary connection.
  * @rmtoll
  *  TCMR     VMSSEL         LL_OPAMP_GetInputMuxInvertingSecondary
  * @param  p_opamp OPAMP instance
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_OPAMP_INPUT_INVERT_IO0
  *         @arg @ref LL_OPAMP_INPUT_INVERT_IO1
  *         @arg @ref LL_OPAMP_INPUT_INVERT_INT_PGA
  *         @arg @ref LL_OPAMP_INPUT_INVERT_INT_FOLLOWER
  */
__STATIC_INLINE uint32_t LL_OPAMP_GetInputMuxInvertingSecondary(const OPAMP_TypeDef *p_opamp)
{
  uint32_t csr_value = STM32_READ_BIT(p_opamp->CSR, OPAMP_CSR_VM_SEL_1);
  uint32_t tcmr_value = STM32_READ_BIT(p_opamp->TCMR, OPAMP_TCMR_VMS_SEL);
  return (uint32_t)(csr_value | (tcmr_value << OPAMP_CSR_VM_SEL_Pos));
}

/**
  * @brief  Set OPAMP both inverting input and non-inverting input secondary connections.
  * @rmtoll
  *  TCMR      VPSSEL         LL_OPAMP_SetInputsMuxSecondary \n
  *  TCMR      VMSSEL         LL_OPAMP_SetInputsMuxSecondary
  * @param  p_opamp OPAMP instance
  * @param  input_non_inverting_sec This parameter can be one of the following values:
  *         @arg @ref LL_OPAMP_INPUT_NONINVERT_IO0
  *         @arg @ref LL_OPAMP_INPUT_NONINVERT_IO1
  *         @arg LL_OPAMP_INPUT_NONINVERT_IO2 (1)
  *         @arg LL_OPAMP_INPUT_NONINVERT_DAC1_CH2 (1)
  *         @arg LL_OPAMP_INPUT_NONINVERT_DAC2_CH1 (2)(3)
  *         @arg LL_OPAMP_INPUT_NONINVERT_DAC2_CH2 (2)
  *
  *         - (1) Parameters only available on STM32C542xx/532xx devices
  *         - (2) Parameters only available on STM32C5P1xx/5Q1xx devices
  *         - (3) Parameters only available on STM32C5J1xx/5K1xx devices
  * @param  input_inverting_sec This parameter can be one of the following values:
  *         @arg @ref LL_OPAMP_INPUT_INVERT_IO0
  *         @arg @ref LL_OPAMP_INPUT_INVERT_IO1
  *         @arg @ref LL_OPAMP_INPUT_INVERT_INT_PGA
  *         @arg @ref LL_OPAMP_INPUT_INVERT_INT_FOLLOWER
  * @note   OPAMP inverting input secondary is used with OPAMP in mode standalone
  *         or PGA with external capacitors for filtering circuit.
  *         Otherwise (OPAMP in mode follower), OPAMP inverting input
  *         is not used (not connected to GPIO pin).
  */
__STATIC_INLINE void LL_OPAMP_SetInputsMuxSecondary(OPAMP_TypeDef *p_opamp,
                                                    uint32_t input_non_inverting_sec, uint32_t input_inverting_sec)
{
  STM32_MODIFY_REG(p_opamp->TCMR, (OPAMP_TCMR_VPS_SEL | OPAMP_TCMR_VMS_SEL),
                   ((input_non_inverting_sec >> 1UL)
                    | (((input_inverting_sec == LL_OPAMP_INPUT_INVERT_IO1)
                        || (input_inverting_sec == LL_OPAMP_INPUT_INVERT_INT_PGA)) ? 1UL : 0UL)));
}

/**
  * @brief  Set OPAMP inputs multiplexer mode.
  * @rmtoll
  *  TCMR     TCMEN          LL_OPAMP_SetMuxInputCtrl
  * @param  p_opamp OPAMP instance
  * @param  mux_inputs_ctrl This parameter can be one of the following values:
  *         @arg @ref LL_OPAMP_MUX_INPUT_CTRL_DISABLE
  *         @arg @ref LL_OPAMP_MUX_INPUT_CTRL_TIM1_OC6
  *         @arg @ref LL_OPAMP_MUX_INPUT_CTRL_TIM2_OC4
  *         @arg @ref LL_OPAMP_MUX_INPUT_CTRL_TIM12_OC1
  *         @arg @ref LL_OPAMP_MUX_INPUT_CTRL_TIM15_OC2
  *         @arg LL_OPAMP_MUX_INPUT_CTRL_TIM8_OC6 (1)(2)
  *         @arg LL_OPAMP_MUX_INPUT_CTRL_TIM20_OC6 (1)
  *         @arg LL_OPAMP_MUX_INPUT_CTRL_TIM3_OC2 (1)(2)
  *
  *         - (1) Parameters only available on STM32C5P1xx/5Q1xx devices
  *         - (2) Parameters only available on STM32C5J1xx/5K1xx devices
  */
__STATIC_INLINE void LL_OPAMP_SetMuxInputCtrl(OPAMP_TypeDef *p_opamp, uint32_t mux_inputs_ctrl)
{
  STM32_MODIFY_REG(p_opamp->TCMR, OPAMP_TCMR_TIMCM_SEL, mux_inputs_ctrl);
}

/**
  * @brief  Get OPAMP inputs multiplexer mode.
  * @rmtoll
  *  TCMR     TCMEN          LL_OPAMP_GetMuxInputCtrl
  * @param  p_opamp OPAMP instance
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_OPAMP_MUX_INPUT_CTRL_DISABLE
  *         @arg @ref LL_OPAMP_MUX_INPUT_CTRL_TIM1_OC6
  *         @arg @ref LL_OPAMP_MUX_INPUT_CTRL_TIM2_OC4
  *         @arg @ref LL_OPAMP_MUX_INPUT_CTRL_TIM12_OC1
  *         @arg @ref LL_OPAMP_MUX_INPUT_CTRL_TIM15_OC2
  *         @arg LL_OPAMP_MUX_INPUT_CTRL_TIM8_OC6 (1)(2)
  *         @arg LL_OPAMP_MUX_INPUT_CTRL_TIM20_OC6 (1)
  *         @arg LL_OPAMP_MUX_INPUT_CTRL_TIM3_OC2 (1)(2)
  *
  *         - (1) Parameters only available on STM32C5P1xx/5Q1xx devices
  *         - (2) Parameters only available on STM32C5J1xx/5K1xx devices
  */
__STATIC_INLINE uint32_t LL_OPAMP_GetMuxInputCtrl(const OPAMP_TypeDef *p_opamp)
{
  return (uint32_t)(STM32_READ_BIT(p_opamp->TCMR, OPAMP_TCMR_TIMCM_SEL));
}

/**
  * @brief  Set OPAMP PGA secondary gain.
  * @rmtoll
  *  TCMR   PGAS_GAIN    LL_OPAMP_SetPGAGainMuxSecondary
  * @param  p_opamp OPAMP instance
  * @param  gain_secondary This parameter can be one of the following values:
  *         @arg @ref LL_OPAMP_PGA_GAIN_2
  *         @arg @ref LL_OPAMP_PGA_GAIN_4
  *         @arg @ref LL_OPAMP_PGA_GAIN_8
  *         @arg @ref LL_OPAMP_PGA_GAIN_16
  *         @arg @ref LL_OPAMP_PGA_GAIN_2_OR_MINUS_1
  *         @arg @ref LL_OPAMP_PGA_GAIN_4_OR_MINUS_3
  *         @arg @ref LL_OPAMP_PGA_GAIN_8_OR_MINUS_7
  *         @arg @ref LL_OPAMP_PGA_GAIN_16_OR_MINUS_15
  * @note   Preliminarily, OPAMP must be set in mode PGA
  *         using function @ref LL_OPAMP_SetConfigurationMode().
  */
__STATIC_INLINE void LL_OPAMP_SetPGAGainMuxSecondary(OPAMP_TypeDef *p_opamp, uint32_t gain_secondary)
{
  STM32_MODIFY_REG(p_opamp->TCMR, OPAMP_TCMR_PGAS_GAIN, (gain_secondary >> 6UL));
}

/**
  * @brief  Get OPAMP PGA gain.
  * @rmtoll
  *  TCMR   PGAS_GAIN      LL_OPAMP_GetPGAGainMuxSecondary
  * @param  p_opamp OPAMP instance
  * @note   Preliminarily, OPAMP must be set in mode PGA
  *         using function @ref LL_OPAMP_SetConfigurationMode().
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_OPAMP_PGA_GAIN_2
  *         @arg @ref LL_OPAMP_PGA_GAIN_4
  *         @arg @ref LL_OPAMP_PGA_GAIN_8
  *         @arg @ref LL_OPAMP_PGA_GAIN_16
  *         @arg @ref LL_OPAMP_PGA_GAIN_2_OR_MINUS_1
  *         @arg @ref LL_OPAMP_PGA_GAIN_4_OR_MINUS_3
  *         @arg @ref LL_OPAMP_PGA_GAIN_8_OR_MINUS_7
  *         @arg @ref LL_OPAMP_PGA_GAIN_16_OR_MINUS_15
  */
__STATIC_INLINE uint32_t LL_OPAMP_GetPGAGainMuxSecondary(const OPAMP_TypeDef *p_opamp)
{
  return (uint32_t)(STM32_READ_BIT(p_opamp->TCMR, OPAMP_TCMR_PGAS_GAIN) << 6UL);
}

/**
  * @brief  Set OPAMP multiplexer PGA gain.
  * @rmtoll
  *  TCMR   TIMPGA_SEL  LL_OPAMP_SetMuxPGAGainCtrl
  * @param  p_opamp OPAMP instance
  * @param  mux_pga_ctrl This parameter can be one of the following values:
  *         @arg @ref LL_OPAMP_MUX_PGA_GAIN_CTRL_DISABLE
  *         @arg @ref LL_OPAMP_MUX_PGA_GAIN_CTRL_TIM1_OC6
  *         @arg @ref LL_OPAMP_MUX_PGA_GAIN_CTRL_TIM2_OC4
  *         @arg LL_OPAMP_MUX_PGA_GAIN_CTRL_TIM12_OC1 (1)(2)
  *         @arg LL_OPAMP_MUX_PGA_GAIN_CTRL_TIM12_OC2 (3)
  *         @arg @ref LL_OPAMP_MUX_PGA_GAIN_CTRL_TIM15_OC2
  *         @arg LL_OPAMP_MUX_PGA_GAIN_CTRL_TIM8_OC6 (1)(2)
  *         @arg LL_OPAMP_MUX_PGA_GAIN_CTRL_TIM20_OC6 (1)
  *         @arg LL_OPAMP_MUX_PGA_GAIN_CTRL_TIM3_OC2 (1)(2)
  *
  *         - (1) Parameters only available on STM32C5P1xx/5Q1xx devices
  *         - (2) Parameters only available on STM32C5J1xx/5K1xx devices
  *         - (3) Parameters only available on STM32C542xx/532xx devices
  */
__STATIC_INLINE void LL_OPAMP_SetMuxPGAGainCtrl(OPAMP_TypeDef *p_opamp, uint32_t mux_pga_ctrl)
{
  STM32_MODIFY_REG(p_opamp->TCMR,  OPAMP_TCMR_TIMPGA_SEL, mux_pga_ctrl);
}

/**
  * @brief  Get OPAMP multiplexer PGA gain.
  * @rmtoll
  *  TCMR   TIMPGA_SEL  LL_OPAMP_GetMuxPGAGainCtrl
  * @param  p_opamp OPAMP instance
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_OPAMP_MUX_PGA_GAIN_CTRL_DISABLE
  *         @arg @ref LL_OPAMP_MUX_PGA_GAIN_CTRL_TIM1_OC6
  *         @arg @ref LL_OPAMP_MUX_PGA_GAIN_CTRL_TIM2_OC4
  *         @arg LL_OPAMP_MUX_PGA_GAIN_CTRL_TIM12_OC1 (1)(2)
  *         @arg LL_OPAMP_MUX_PGA_GAIN_CTRL_TIM12_OC2 (3)
  *         @arg @ref LL_OPAMP_MUX_PGA_GAIN_CTRL_TIM15_OC2
  *         @arg LL_OPAMP_MUX_PGA_GAIN_CTRL_TIM8_OC6 (1)(2)
  *         @arg LL_OPAMP_MUX_PGA_GAIN_CTRL_TIM20_OC6 (1)
  *         @arg LL_OPAMP_MUX_PGA_GAIN_CTRL_TIM3_OC2 (1)(2)
  *
  *         - (1) Parameters only available on STM32C5P1xx/5Q1xx devices
  *         - (2) Parameters only available on STM32C5J1xx/5K1xx devices
  *         - (3) Parameters only available on STM32C542xx/532xx devices
  */
__STATIC_INLINE uint32_t LL_OPAMP_GetMuxPGAGainCtrl(const OPAMP_TypeDef *p_opamp)
{
  return (uint32_t)(STM32_READ_BIT(p_opamp->TCMR, OPAMP_TCMR_TIMPGA_SEL));
}

/**
  * @brief  Set the output connection for OPAMP instance.
  * @rmtoll
  *  CSR      OPAINTOEN       LL_OPAMP_SetOutputConnection
  * @param  p_opamp OPAMP instance
  * @param  opamp_out This parameter can be one of the following values:
  *         @arg LL_OPAMP_OUTPUT_CONNECT_EXTERNAL
  *         @arg LL_OPAMP_OUTPUT_CONNECT_INTERNAL
  */
__STATIC_INLINE void LL_OPAMP_SetOutputConnection(OPAMP_TypeDef *p_opamp, uint32_t opamp_out)
{
  STM32_MODIFY_REG(p_opamp->CSR, OPAMP_CSR_OPAINTOEN, opamp_out);
}

/**
  * @brief  Get the current output connection state for OPAMP instance.
  * @rmtoll
  *  CSR      OPAINTOEN       LL_OPAMP_GetOutputConnection
  * @param  p_opamp OPAMP instance
  * @retval LL_OPAMP_OUTPUT_CONNECT_EXTERNAL if the output is connected to the OPAMP_VOUT pin.
  * @retval LL_OPAMP_OUTPUT_CONNECT_INTERNAL if the output is connected internally to an ADC/COMP channel.
  */
__STATIC_INLINE uint32_t LL_OPAMP_GetOutputConnection(const OPAMP_TypeDef *p_opamp)
{
  return ((STM32_READ_BIT(p_opamp->CSR, OPAMP_CSR_OPAINTOEN) != 0UL) \
          ? LL_OPAMP_OUTPUT_CONNECT_INTERNAL : LL_OPAMP_OUTPUT_CONNECT_EXTERNAL);
}

/**
  * @}
  */

/**
  * @}
  */

/**
  * @}
  */
#endif /* OPAMP1 || OPAMP2 || OPAMP3 */

/**
  * @}
  */

#ifdef __cplusplus
}
#endif

#endif /* STM32C5xx_LL_OPAMP_H */
